       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
      *=====================================================
      *==   Autor: Caio              EMPRESA: INFORMATICA
      *==  Objetivo: 1o Contato com Cobol
      *==  Data: 03/05/2025
      *==  Observacoes:
      *======================================================
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
      *==  uma mesagem de texto entre duas pessoas
       DISPLAY "Ola Caio"
       DISPLAY "Tudo bem"
       DISPLAY "Boa noite"
       DISPLAY "vc e Programador"
       DISPLAY 'sim eu sou Programador'
       STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
